[{"source": {"id": null, "name": "Windsorstar.com"}, "author": "Doug Schmidt, Windsor Star", "title": "Viral virus video highlights COVID-19 panic shopping in Windsor - Windsor Star", "description": "Viral virus video highlights COVID-19 panic shopping in Windsor Windsor Star COVID-19 panic buying hits grocery stores across Canada CTV News Grocery stores hit with Coronavirus COVID-19 shopping surge: grocery store chain owner Scott Karns PennLive.com Coron…", "url": "https://windsorstar.com/news/local-news/viral-virus-video-highlights-covid-19-panic-shopping-in-windsor", "urlToImage": null, "publishedAt": "2020-03-14T01:25:10Z", "content": "we estimated 10 or 11 per cent of the population would panicbuy and theyre doing that right now but itll soon pass said charlebois senior director of the agrifood analytics lab at dalhousie university in halifax and known as the food professorthe food 1196 chars"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Christine Fisher", "title": "Starbucks embraces fake meat, starting in Canada", "description": "Next week, when Starbucks rolls out its spring menu in stores across Canada, it will include one notable addition: a breakfast sandwich with Beyond Meat sausage. Starbucks joins a growing list of brands that have added Beyond Meat's plant-based offerings to t…", "url": "https://www.engadget.com/2020/02/26/starbucks-beyond-meat-sandwich-canada/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D5000%252C3128%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1001%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2020-02%252Fcf6f7ae0-58c6-11ea-aefe-04d1efc8098d%26client%3Da1acac3e1b3290917d92%26signature%3D0547d1c659821a99d00cb59c28fb67b2dea74c6d&client=amp-blogside-v2&signature=ae7586f0237dcb6746221eff11711e4f35d760f4", "publishedAt": "2020-02-26T19:35:00Z", "content": "the labgrown plantbased meat trend is a product of science and tech but its also driven by a growing awareness of the environmental impacts of meat production earlier this year starbucks said it was committed to a resourcepositive future which incl 713 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "Better know a CSO: Indiana University Health’s Mitch Parker", "description": "Mitch Parker has one of Indiana’s most critical jobs. As chief information security officer for Indiana University Health, Parker oversees cybersecurity for more than 30,000 employees at 18 hospitals across the state, along with countless numbers of computers…", "url": "http://techcrunch.com/2020/03/23/better-know-a-cso-indiana-university-healths-mitch-parker/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-1160670986.jpg?w=599", "publishedAt": "2020-03-23T21:15:08Z", "content": "mitch parker has one of indianas most critical jobsas chief information security officer for indiana university health parker oversees cybersecurity for more than 30000 employees at 18 hospitals across the state along with countless numbers of computer 1979 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Andrew Weichel", "title": "Vancouver university temporarily closed over 'possible student exposure' to COVID-19 - CTV News", "description": "Vancouver university temporarily closed over 'possible student exposure' to COVID-19 CTV News University Canada West closes Vancouver campus following presumptive case of COVID-19 Global News View Full coverage on Google News", "url": "https://bc.ctvnews.ca/vancouver-university-temporarily-closed-over-possible-student-exposure-to-covid-19-1.4840310", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4840313.1583430663!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-05T17:54:00Z", "content": "vancouver  a small private university in downtown vancouver is closing its campus for three days after learning two students may have been exposed to covid19university canada west announced thursday the students have both been placed in isolation and  905 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "UK researchers develop new low-cost, rapid COVID-19 test that could even be used at home", "description": "A new type of test developed by UK researchers from the Brunel University London, Lancaster University and the University of Surrey can provide COVID-19 detection in as little as 30 minutes, using hand-held hardware that costs as little as £100 (around $120 U…", "url": "http://techcrunch.com/2020/03/25/uk-researchers-develop-new-low-cost-rapid-covid-19-test-that-could-even-be-used-at-home/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-1209679043.jpg?w=711", "publishedAt": "2020-03-25T14:03:12Z", "content": "a new type of test developed by uk researchers from the brunel university london lancaster university and the university of surrey can provide covid19 detection in as little as 30 minutes using handheld hardware that costs as little as 100 around 120 u 2062 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "Canada closes border to “all foreign nationals” except Americans, will block even citizens with symptoms", "description": "Canadian Prime Minister Justin Trudeau announced a number of additional measures being taken at a federal level in Canada to prevent further spread of coronavirus within the country. The most extreme is that Canada is closing its borders to non-citizens and a…", "url": "http://techcrunch.com/2020/03/16/canada-closes-border-to-all-foreign-nationals-except-americans-will-block-even-citizens-with-symptoms/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/Screen-Shot-2020-03-16-at-2.00.23-PM.png?w=716", "publishedAt": "2020-03-16T18:10:13Z", "content": "canadian prime minister justin trudeau announced a number of additional measures being taken at a federal level in canada to prevent further spread of coronavirus within the country the most extreme is that canada is closing its borders to noncitizens and a 1880 chars"}, {"source": {"id": null, "name": "Citynews1130.com"}, "author": null, "title": "Experts: No reason to panic as shelves seem bare amid virus concerns - CityNews Vancouver", "description": "Experts: No reason to panic as shelves seem bare amid virus concerns CityNews Vancouver Coronavirus Panic In Montreal Leaves Grocery Store Shelves Empty & Here's Metro's Solution MTL Blog Capturing the coronavirus mood through one Toronto grocery store The Gl…", "url": "https://www.citynews1130.com/2020/03/14/no-reason-panic-shelves-bare-amid-virus-concerns/", "urlToImage": "https://www.citynews1130.com/wp-content/blogs.dir/sites/9/2020/03/13/emptyaislesaveon1.jpg", "publishedAt": "2020-03-14T15:50:52Z", "content": "toronto news 1130  grocery store shelves across the country are being emptied by those concerned about the spread of covid19 with toilet paper and canned goods being some of the hottest itemsaccording to a food expert there is no reason to panic as c 1041 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "jonazpiri", "title": "University Canada West closes Vancouver campus following presumptive case of COVID-19 - Global News", "description": "University Canada West closes Vancouver campus following presumptive case of COVID-19 Global News COVID-19 precautions close Vancouver business school for 3-day disinfection CBC.ca Vancouver university temporarily closed over 'possible student exposure' to CO…", "url": "http://globalnews.ca/news/6636184/university-canada-west-closes-vancouver-campus-following-presumptive-case-of-covid-19/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/ucw-e1583433805249.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-05T19:24:10Z", "content": "a private vancouver university says it has closed its doors after identifying a student with a presumptive case of covid19in a statement university canada west said the student had been visited by their father who has positively been tested for covid19 925 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Timeline coronavirus (COVID-19) in Canada - CTV News", "description": "Timeline coronavirus (COVID-19) in Canada CTV News Husband of Toronto woman who returned from Iran now Ontario's sixth COVID-19 case CP24 Toronto's Breaking News Husband of Ontario's fifth COVID-19 patient also tests positive for virus CTV News Husband of COV…", "url": "https://www.ctvnews.ca/canada/novel-coronavirus-in-canada-here-s-a-timeline-of-covid-19-cases-across-the-country-1.4829917", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4802131.1581100573!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-02-27T14:16:00Z", "content": "toronto  health officials in ontario have confirmed another case of the novel coronavirus in the province there have been 13 cases of covid19 diagnosed in canada  six in ontario and seven in british columbiahere is a timeline of canadian casesfe 3975 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Andrew Russell", "title": "Coronavirus: How is Canada planning to enforce mandatory self-isolation? - Global News", "description": "Coronavirus: How is Canada planning to enforce mandatory self-isolation? Global News Strict new mandatory quarantine rules in effect for returning Canadians CBC.ca Travellers returning home must enter mandatory isolation: health minister CTV News What you nee…", "url": "http://globalnews.ca/news/6736381/coronavirus-canada-quarantine-act-mandatory-self-isolation/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/jdt11254501.jpg?quality=70&strip=all&crop=0px%2C68px%2C1024px%2C541px&resize=720%2C379", "publishedAt": "2020-03-26T18:43:43Z", "content": "the federal government is deploying the quarantine act in the fight against covid19 imposing mandatory selfisolation rules for any traveller returning to canada with fines and even jail time for those who break the rulesthe legislation which went into  7721 chars"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Big Brother Canada ends season early due to COVID-19 developments - CBC.ca", "description": "Big Brother Canada ends season early due to COVID-19 developments CBC.ca ‘Big Brother Canada’ officially ending Season 8, ceasing production due to coronavirus Global News Big Brother Canada Season 8 suspends production Toronto Sun Big Brother Canada season c…", "url": "https://www.cbc.ca/news/entertainment/bigbrother-cda-ends-due-coronavirus-1.5508418", "urlToImage": "https://i.cbc.ca/1.5508442.1585075568!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-big-brother-canada-20200324.jpg", "publishedAt": "2020-03-24T20:07:00Z", "content": "just over a week after announcing production was still underway on big brother canadadespite the global covid19 crisis producers now say the reality series has ended earlyglobal and insight productions say production on season 8 is now done in light of  3149 chars"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "WeChat has been censoring keywords about coronavirus, study finds", "description": "China’s hugely-popular WeChat has been censoring keywords about coronavirus, according to a report published by Citizen Lab. The report also found that popular Chinese livestreaming platform YY has been censoring coronavirus content.", "url": "https://www.theverge.com/2020/3/3/21163844/wechat-yy-censoring-coronavirus-keywords-citizen-lab", "urlToImage": "https://cdn.vox-cdn.com/thumbor/55fbKOC0eWZOYlqMer8XYOd6zq0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13545758/acastro_181126_1777_weChat_0003.jpg", "publishedAt": "2020-03-04T02:12:34Z", "content": "chinese livestreaming platform yy has also been censoring coronavirus contentillustration by alex castro  the vergechinas most popular messaging app tencentowned wechat has been censoring keywords about coronavirus since as early as january 1st an a 2715 chars"}, {"source": {"id": null, "name": "Menafn.com"}, "author": "MENAFN", "title": "Richard leBrasseur - MENAFN.COM", "description": "(MENAFN - The Conversation) Dr. Rick leBrasseur is an Associate Professor of Landscape Architecture at Dalhousie University within the Department of Plant, Food and Environmental Sciences.\nA licensed landscape architect, environmental psychologist, researcher…", "url": "https://menafn.com/1099907925/Richard-leBrasseur", "urlToImage": "https://menafn.com/updates/pr/2020-03/24/TC_4ec67022-eimage_story.jpg", "publishedAt": "2020-03-25T03:35:58Z", "content": "menafn  the conversation dr rick lebrasseur is an associate professor of landscape architecture at dalhousie university within the department of plant food and environmental sciencesa licensed landscape architect environmental psychologist researche 3095 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Carly Yoshida-Butryn", "title": "Protest shuts down major Vancouver intersection | CTV News - CTV News", "description": "Protest shuts down major Vancouver intersection | CTV News CTV News Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action Global News B.C. students join nationwide school walkout in support of Wet'suwet'en hereditary chiefs CB…", "url": "https://bc.ctvnews.ca/protest-shuts-down-major-vancouver-intersection-1.4839267", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4839343.1583367601!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-04T23:51:00Z", "content": "vancouver  a student walkout in support of the wetsuweten hereditary chiefs who oppose a liquefied natural gas pipeline through their traditional territory closed the intersection of west 49th avenue and cambie street in vancouver during the afternoon r 1488 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Graham Slaughter", "title": "Canada confirms first 'community case' of COVID-19: Here's what that means - CTV News", "description": "Canada confirms first 'community case' of COVID-19: Here's what that means CTV News 8 more cases of COVID-19 virus identified in B.C., including 1 of unknown origin CBC.ca Coronavirus outbreak: Canadian WHO doctor returns from China with critical COVID-19 les…", "url": "https://www.ctvnews.ca/health/coronavirus/canada-confirms-first-community-case-of-covid-19-here-s-what-that-means-1.4841249", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4841264.1583461677!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-06T02:30:00Z", "content": "toronto  a woman in bc has tested positive for covid19 despite not having travelled recently and having no known contact with anyone infected with the virusuntil now all cases in canada involved individuals who had recently travelled to countries s 3516 chars"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Business report: Will small businesses survive the pandemic? - CityNews Toronto", "description": "Business report: Will small businesses survive the pandemic? CityNews Toronto 30 per cent of small businesses fear they won’t survive coronavirus pandemic 680 News Small business confidence has 'never been this low' in Canada, CFIB says CTV News Local busines…", "url": "https://www.youtube.com/watch?v=4rIw_c3yTmo", "urlToImage": null, "publishedAt": "2020-03-25T22:34:14Z", "content": "getsimplestringdatatitlegetsimplestringdatadescriptiongetsimplestringdatavideocounttext"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Ont. hospital to set up special COVID-19 clinic to ease busy emergency rooms - CTV News", "description": "As hospitals and health care facilities across Canada prepare to handle the spread of coronavirus seen around the world, some doctors are worried about a potential flood of patients hitting emergency rooms.", "url": "https://www.ctvnews.ca/health/ont-hospital-to-set-up-special-covid-19-clinic-to-ease-busy-emergency-rooms-1.4839575", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4839580.1583377938!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-05T03:12:00Z", "content": "toronto  as hospitals and health care facilities across canada prepare to handle the spread of coronavirus seen around the world some doctors are worried about a potential flood of patients hitting emergency roomsdr jeff powis the medical director o 5018 chars"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Natasha Piñon", "title": "How to support girls' and women's education", "description": "It's the MOST wonderful time of the year: International Women's Day! The commemorative day comes along once a year, on Mar. 8, and marks the perfect time to get a game plan together for supporting women around the world. The United Nation's theme this year — …", "url": "https://mashable.com/article/how-to-help-girls-education/", "urlToImage": "https://mondrian.mashable.com/2020%252F03%252F08%252F5c%252F620915a2c97442af95596d21e32b1941.8e8ae.jpg%252F1200x630.jpg?signature=BAVP13HK0ObG3j1ZFIUPro2xnlI=", "publishedAt": "2020-03-08T13:00:00Z", "content": "its the most wonderful time of the year international womens daythe commemorative day comes along once a year on mar 8 and marks the perfect time to get a game plan together for supporting women around the worldthe united nations theme this yea 3857 chars"}, {"source": {"id": null, "name": "Aldergrovestar.com"}, "author": "Katya Slepian", "title": "COVID-19: What's open and closed in BC as a result of the novel coronavirus - Aldergrove Star", "description": "COVID-19: What's open and closed in BC as a result of the novel coronavirus Aldergrove Star Coronavirus: Lush to close all 258 stores in Canada, U.S. and to slow production Global News COVID-19: What’s open and closed in B.C. amid the novel coronavirus pandem…", "url": "https://www.aldergrovestar.com/news/covid-19-whats-open-and-closed-in-b-c-amid-the-novel-coronavirus-pandemic/", "urlToImage": "https://www.aldergrovestar.com/wp-content/uploads/2020/03/20942549_web1_22932031-1024x683.jpg", "publishedAt": "2020-03-16T00:30:00Z", "content": "as covid19 cases continue to rise in canada heres whats open closed and not advised especially in bcas of sunday there were at least 313 cases in canada 73 of those in blush closes all storesnatural bath skincare and cosmetics retailer lush 3333 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Leap Finance raises $5.5M to democratize financing for foreign-bound Indian students", "description": "Tens of thousands of Indians move to the United States to pursue higher education each year. But like many others who have arrived from a foreign land, they can’t secure education loans or personal loans from the banks at interest rates on par with those levi…", "url": "http://techcrunch.com/2020/03/03/leap-finance-indian-students-loans/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-657065708.jpg?w=600", "publishedAt": "2020-03-03T16:25:21Z", "content": "tens of thousands of indians move to the united states to pursue higher education each year but like many others who have arrived from a foreign land they cant secure education loans or personal loans from the banks at interest rates on par with those levie 3342 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Mascarenhas", "title": "Coursedog lands $4.2 million to make class scheduling smarter", "description": "Two years ago, dormmates Justin Wenig and Nicholas Diao struggled to get into a popular computer science class at Columbia University. The duo eventually got into that class, but after the initial frustration around class scheduling, they decided “it was an o…", "url": "http://techcrunch.com/2020/03/09/coursedog-lands-4-2-million-to-make-class-scheduling-smarter/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2014/03/lecture-room-university.jpg?w=533", "publishedAt": "2020-03-09T18:58:46Z", "content": "two years ago dormmates justin wenig and nicholas diao struggled to get into a popular computer science class at columbia university  the duo eventually got into that class but after the initial frustration around class scheduling they decided it was an o 2730 chars"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Plans for first US 'safe injection site' derailed again", "description": "The addiction management method used in Europe and Canada has met determined opposition in the US.", "url": "https://www.bbc.co.uk/news/world-us-canada-51669192", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0952/production/_111068320_gettyimages-1166209978.jpg", "publishedAt": "2020-02-28T02:09:51Z", "content": "image copyrightgetty imagesimage caption the latest plans to open a safe injection site in the us have been derailed againplans to open the first safe drug injection site in the us have been scrapped after being met with opposition in philadelphiathe 3168 chars"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Exploratory talks between Ontario high school teachers’ union and government break off - The Globe and Mail", "description": "Exploratory talks between Ontario high school teachers’ union and government break off The Globe and Mail Ford government backs down on high school class sizes, e-learning ahead of more Ont. teacher strikes CTV News I'm An Ontario Teacher But I Chose To Go Wh…", "url": "https://www.theglobeandmail.com/canada/article-ontario-high-school-teachers-union-shuts-down-informal-talks-with/", "urlToImage": "https://www.theglobeandmail.com/resizer/XzZ0h2IXPv6PRN8Sx-9wMph5ln0=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/ZDUNUYMTI5EFTKOZGMTWREAK4Y.JPG", "publishedAt": "2020-03-04T20:41:38Z", "content": "thousands of picketers from the four main teachers unions march around queens park during a provincewide strike in toronto on feb 21 2020 tijana martinthe globe and mailthe union representing highschool teachers has ended informal contract talks wi 4261 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Katie Scott", "title": "‘Big Brother Canada’ Season 8: Meet the houseguests - Global News", "description": "‘Big Brother Canada’ Season 8: Meet the houseguests Global News Angela Tackie Is Looking For 'Multiple Showmances' On 'Big Brother Canada' | EXTENDED ET Canada Kamloops reporter lands a spot on Big Brother Canada CFJC Today Kamloops Kamloops 'surfer dude' mak…", "url": "http://globalnews.ca/news/6593527/big-brother-canada-8-houseguests/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/02/bbcan-8-cast.jpg?quality=70&strip=all&crop=0px%2C0px%2C1280px%2C676px&resize=720%2C379", "publishedAt": "2020-02-26T19:55:32Z", "content": "big brother canadais backon wednesday the 16 new houseguests were revealed after weeks of anticipation theyre set to enter the big brother canada bbcan house very soon with the supersized season 8 premiering on global on march 4 at 7 pm etptt 6691 chars"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Chrystia Freeland calls for ‘whole of country’ response to prevent spread of coronavirus - The Globe and Mail", "description": "Chrystia Freeland calls for ‘whole of country’ response to prevent spread of coronavirus The Globe and Mail Containment efforts will delay, not prevent, COVID-19 outbreak in Canada, Hajdu warns CBC.ca Global National: March 4, 2020 | How Canada is preparing f…", "url": "https://www.theglobeandmail.com/politics/article-chrystia-freeland-calls-for-whole-of-country-response-to-prevent/", "urlToImage": "https://www.theglobeandmail.com/resizer/NprVLTEaK64HZ8-6GWFIaM5OxpQ=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/4XTKAWTDANCVJK3NV4TCPYKNM4.jpg", "publishedAt": "2020-03-05T02:07:54Z", "content": "deputy prime minister chrystia freeland and health minister patty hajdu both seen here at the national press theatre in ottawa on march 4 2020 said at the news conference that all canadians have a role to play justin tangthe canadian pressdeputy prim 6866 chars"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US, Canada and Mexico restrict border traffic", "description": "As the US battles the coronavirus outbreak, \"non-essential\" traffic is suspended across its borders.", "url": "https://www.bbc.co.uk/news/world-us-canada-51980681", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/BDAD/production/_111375584_060726149-1.jpg", "publishedAt": "2020-03-20T17:21:42Z", "content": "image copyrightreutersimage caption many checkpoints on the uscanada border are closingthe us has suspended all nonessential traffic across its borders with both mexico and canada as it battles to control the coronavirus outbreakthe curbs will go int 1377 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "As social distancing measure, Starbucks temporarily shifts to ‘to go’ model in US and Canada", "description": "Beginning today, Starbucks is instituting a temporary move to a “to go” model for all of its locations in the U.S. and Canada. One of the more sweeping actions taken by a major food chain, the coffee giant is looking to adhere to advice about social distancin…", "url": "http://techcrunch.com/2020/03/15/as-social-distancing-measure-starbucks-temporarily-shifts-to-to-go-model-in-us-and-canada/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2016/12/starbucks_logo_2016.jpg?w=600", "publishedAt": "2020-03-15T22:48:30Z", "content": "beginning today starbucks is instituting a temporary move to a to go model for all of its locations in the us and canada one of the more sweeping actions taken by a major food chain the coffee giant is looking to adhere to advice about social distancing  1309 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "U.S. and Canada border to close to all but “non-essential” and travel, says Trump", "description": "The U.S./Canada border has remained open despite measures by both countries to block and limit international flights and mobility in light of the coronavirus pandemic, but that is changing today as the two countries have agreed, “by mutual consent,” to suspen…", "url": "http://techcrunch.com/2020/03/18/u-s-and-canada-border-to-close-to-all-but-non-essential-and-travel-says-trump/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-594370810.jpg?w=764", "publishedAt": "2020-03-18T14:10:06Z", "content": "the uscanada border has remained open despite measures by both countries to block and limit international flights and mobility in light of the coronavirus pandemic but that is changing today as the two countries have agreed by mutual consent to suspen 1426 chars"}, {"source": {"id": null, "name": "Huffingtonpost.ca"}, "author": "Daniel Tencer", "title": "Canadian Gun Sales Spike Amid Fears Of COVID-19, Tougher Firearms Laws - HuffPost Canada", "description": "Canadian Gun Sales Spike Amid Fears Of COVID-19, Tougher Firearms Laws HuffPost Canada Gun sales surge as coronavirus pandemic spreads CNN COVID-19: Coronavirus, law fears fuel spike in firearms, ammunition sales across Canada CTV News Canada Gun Stores Repor…", "url": "https://www.huffingtonpost.ca/entry/gun-sales-canada_ca_5e727d54c5b6eab779414ffc", "urlToImage": "https://img.huffingtonpost.com/asset/5e72803d2300002b1ade4a74.jpeg?ops=1200_630", "publishedAt": "2020-03-18T20:55:52Z", "content": "toronto the covid19 outbreak coupled with fears about more restrictive gun legislation has fuelled a spike in firearm and ammunition sales several dealers said this weekbuyers they say are stocking up while they can a development that has alarmed gunc 2860 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "Uber suspends Uber Pool shared rides in the U.S. and Canada to help limit coronavirus spread", "description": "Uber has suspended its shared ‘Uber Pool’ class of rides, the company announced on Tuesday. The Uber Pool option would match up to three passengers together in one vehicle based on their destination, and Uber said in a statement from Uber Rides and Platform V…", "url": "http://techcrunch.com/2020/03/17/uber-suspends-uber-pool-shared-rides-in-the-u-s-and-canada-to-help-limit-coronavirus-spread/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/UberIM_20077-2.jpg?w=600", "publishedAt": "2020-03-17T11:12:43Z", "content": "uber has suspended its shared uber pool class of rides the company announced on tuesday the uber pool option would match up to three passengers together in one vehicle based on their destination and uber said in a statement from uber rides and platform v 1336 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Laura Osman", "title": "Canada releases coronavirus guidelines on when to cancel major events - CTV News", "description": "Canada releases coronavirus guidelines on when to cancel major events CTV News Federal government to announce supports for people, businesses hit by COVID-19 on Wednesday CBC.ca Ottawa to release unprecedented report into foreign espionage in Canada Toronto S…", "url": "https://www.ctvnews.ca/health/coronavirus/canada-releases-coronavirus-guidelines-on-when-to-cancel-major-events-1.4847684", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4847696.1583888508!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-11T02:40:04Z", "content": "ottawa  the public health agency of canada has posted guidelines aimed at helping event planners figure out whether to cancel mass gatherings of people as the federal government works to quell the potential spread of the novel coronavirusthe next best  4694 chars"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Canadians urged to stay home to help stall spread of coronavirus - The Globe and Mail", "description": "Canadians urged to stay home to help stall spread of coronavirus The Globe and Mail Coronavirus: All publicly funded schools in Ontario closing for 2 weeks due to COVID-19 Global News Toronto Public Health urges caution on public gatherings Toronto Star 18 mo…", "url": "https://www.theglobeandmail.com/canada/article-canadians-urged-to-stay-home-to-help-stall-spread-of-coronavirus/", "urlToImage": "https://www.theglobeandmail.com/resizer/zv8IFaYa6KPDYiKHhfVl0dMe6OY=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/EM6FXCZVZ5B6RAHZZDY7LLZQYI.jpg", "publishedAt": "2020-03-13T01:49:36Z", "content": "these are extraordinary times and we have to take every measure possible federal health minister patty hajdu seen here on march 12 2020 saidsean kilpatrickthe canadian pressontario closed its schools and suspended jury trials bc advised against 7458 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Heather Yourex-West", "title": "Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action - Global News", "description": "Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action Global News Trudeau urges patience as Wet'suwet'en consider proposed land and title deal CBC.ca Indigenous Canadians concerned about racist backlash over Wet'suwet'en rail …", "url": "http://globalnews.ca/news/6626029/indigenous-people-canada-racism-wetsuweten-blockades/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/02/22806103.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-04T02:37:40Z", "content": "gabrielle lindstrom says the last few weeks have made her sadthe calgary professor is an indigenous woman and has been speaking with her students a lot about racism in recent weekswhile she doesnt believe the tensions surrounding the wetsuweten solid 3238 chars"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Bank of Canada rate cut will put already hot real estate market 'on steroids' - The Globe and Mail", "description": "Bank of Canada rate cut will put already hot real estate market 'on steroids' The Globe and Mail Bank of Canada lowers overnight rate target to 1 ¼ percent Bank of Canada Bank of Canada cuts key interest rate target to 1.25 per cent CTV News Now is the worst …", "url": "https://www.theglobeandmail.com/business/article-bank-of-canada-rate-cut-will-put-already-hot-real-estate-market-on/", "urlToImage": "https://www.theglobeandmail.com/resizer/VLNcDQHs8-Ew0rW7LWNAjP7Ykhw=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/IIYAEABO2REMZLUY62WESTOJFE.JPG", "publishedAt": "2020-03-04T23:31:36Z", "content": "a home that is sold is photographed along runnymede rd in toronto on wednesday march 4 2020 tijana martinthe globe and mailthe bank of canadas interestrate cut threatens to overheat the countrys booming housing markets making it easier for home buy 4893 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Tracking every case of COVID-19 in Canada - CTV News", "description": "Tracking every case of COVID-19 in Canada CTV News How Canada's designated COVID-19 testing centres work CBC News Ontario confirms 19 new cases of coronavirus, bringing provincial total to 79 Global News What’s closed or cancelled in Toronto amid coronavirus …", "url": "https://www.ctvnews.ca/health/coronavirus/tracking-every-case-of-covid-19-in-canada-1.4852102", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4816103.1581987337!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-13T18:17:00Z", "content": "toronto  the first case of covid19 in canada was confirmed on january 25 2020 after a man travelling from wuhan china tested positive for the coronavirus since then the virus has made its way through 7 provinces and as of march 13 2020 canada has  24414 chars"}, {"source": {"id": null, "name": "Citynews1130.com"}, "author": null, "title": "U of C researchers highlight the importance of hand hygiene - CityNews Vancouver", "description": "CALGARY (CityNews) – An open-source tool designed by University of Calgary researchers is gaining traction as a way to help remind people to wash their hands. This, as Canada reported more cases of COVID-19 on Thursday. READ MORE: WHO racing to send supplies …", "url": "https://www.citynews1130.com/2020/03/05/u-of-c-researchers-highlight-the-importance-of-hand-hygiene/", "urlToImage": "https://www.citynews1130.com/wp-content/blogs.dir/sites/9/2020/03/dr-hand-wash-e1583448462609.jpg", "publishedAt": "2020-03-05T23:32:42Z", "content": "calgary citynews  an opensource tool designed by university of calgary researchers is gaining traction as a way to help remind people to wash their handsthis as canada reported more cases of covid19 on thursdayread morewho racing to send supplie 1957 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "graemebenjamin1", "title": "N.S. bans evictions while committing funds to Feed Nova Scotia, income assistance - Global News", "description": "N.S. bans evictions while committing funds to Feed Nova Scotia, income assistance Global News One person in N.S. hospitalized as a result of COVID-19 CTV News NS, NB pharmacies restrict medication fills to avoid shortages during COVID-19 Global News N.S. boos…", "url": "http://globalnews.ca/news/6701640/n-s-bans-evictions/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/press-briefing.png?w=720&h=379&crop=1", "publishedAt": "2020-03-19T20:31:31Z", "content": "the nova scotia government is making sure tenants impacted by the covid19 outbreak cant be evicted while also committing 1 million to food banks across the provincethe announcements were made a press briefing in halifax on thursday which was held virtu 4043 chars"}, {"source": {"id": null, "name": "Canoe.com"}, "author": null, "title": "Trump's ban on travel from Europe poses questions for Canada border - Toronto Sun", "description": "Trump's ban on travel from Europe poses questions for Canada border Toronto Sun Trump's Europe travel ban poses questions for Canada-U.S. border CTV News Fact check: Trump makes four key errors or omissions in Europe travel announcement CNN Donald Trump has s…", "url": "https://canoe.com/news/national/trumps-ban-on-travel-from-europe-poses-questions-for-canada-u-s-border", "urlToImage": "https://postmediatorontosun.files.wordpress.com/2020/03/terminal2.jpg", "publishedAt": "2020-03-12T21:06:00Z", "content": "canada and the united states conferred over the fate of their shared border one day after president donald trumps slammed americas door shut to foreign nationals who recently spent time in europe to stop covid19 contagiondeputy prime minister chrystia  9510 chars"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "US-Canada border to close amid virus crisis", "description": "Donald Trump and his Canadian counterpart Justin Trudeau are stopping all but essential travel.", "url": "https://www.bbc.co.uk/news/world-us-canada-51949243", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7A23/production/_97176213_breaking_news_bigger.png", "publishedAt": "2020-03-18T13:59:46Z", "content": "us president donald trump and canadian prime minister justin trudeau have agreed to close the uscanada border to all nonessential travel in an attempt to curb the spread of coronavirus we will be by mutual consent temporarily closing our northern bord 1059 chars"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jen Rose Smith, CNN", "title": "With governments limiting non-essential travel, what's essential travel?", "description": "Freedom of movement at the world's longest land border diminished on Wednesday when President Donald Trump announced restrictions on travel between the United States and Canada.", "url": "https://www.cnn.com/travel/article/essential-travel-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200318101551-01-us-canada-border-file-super-tease.jpg", "publishedAt": "2020-03-19T18:57:18Z", "content": "jen rose smith cnn updated 19th march 2020cnn freedom of movement at the worlds longest land border diminished on wednesday when president donald trump announced restrictions on travel between the united states and canada we will be by mutual conse 5933 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "rdamore", "title": "Canadian coronavirus cases linked to Iran rise, experts question country’s response - Global News", "description": "Canadian coronavirus cases linked to Iran rise, experts question country’s response Global News Husband of COVID-19 patient in Toronto tests positive for virus, say health officials CityNews Toronto 7th COVID-19 case confirmed in Ontario, man who travelled to…", "url": "http://globalnews.ca/news/6608406/coronavirus-iran-response-canada/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/02/22807083-e1582917050583.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-02-28T19:59:40Z", "content": "as canadian cases of the new coronavirus linked to iran grow so does the scrutiny surrounding how the country has handled the crisis so farthe outbreak of covid19 in iran has escalated quickly  with at least 388 confirmed cases and 34 deaths it has the 5172 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Mike Butcher", "title": "Founders Factory backs Creator Fund, student-led VC to back EU student startups", "description": "It seems like everyone wants student entrepreneurs. Entrepreneur First makes startups out of raw student material, for instance. Most countries want high-skilled students to stick around and make new companies. Only the UK likes to charge them a fortune for a…", "url": "http://techcrunch.com/2020/02/26/founders-factory-backs-creator-fund-student-led-vc-to-back-eu-student-startups/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/02/SBH_6586.jpg?w=599", "publishedAt": "2020-02-27T00:01:52Z", "content": "it seems like everyone wants student entrepreneurs entrepreneur first makes startups out of raw student material for instance most countries want highskilled students to stick around and make new companies only the uk likes to charge them a fortune for a 3050 chars"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Catie Keck", "title": "Uber Suspends Pool Service in U.S. and Canada Amid Covid-19 Outbreak", "description": "As health officials call for social distancing amid the global coronavirus pandemic as a means of mitigating its spread, Uber has announced that it’s suspended all Pool services in the United States and Canada as of Tuesday. Read more...", "url": "https://gizmodo.com/uber-suspends-pool-service-in-u-s-and-canada-amid-covi-1842377373", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/shse7j6ux0bcezhd1cji.jpg", "publishedAt": "2020-03-17T15:00:00Z", "content": "as health officials call for social distancing amid the global coronavirus pandemic as a means of mitigating its spread uber has announced that its suspended all pool services in the united states and canada as of tuesdaythe company said the decision was  1939 chars"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Starbucks to close nearly all Canadian locations, only drive-through and delivery will remain open - The Globe and Mail", "description": "Starbucks to close nearly all Canadian locations, only drive-through and delivery will remain open The Globe and Mail Starbucks is officially closing all of its cafes across Canada | Dished Daily Hive Starbucks temporarily closing most locations in Canada due…", "url": "https://www.theglobeandmail.com/business/article-starbucks-to-close-nearly-all-locations-only-drive-through-and/", "urlToImage": "https://www.theglobeandmail.com/resizer/-Ihm7Io73M_t4XKHMHxPqlNJxzw=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/K6JIZENHMZCZNNSVS6UKFZMTJY.jpg", "publishedAt": "2020-03-21T00:48:32Z", "content": "pedestrians walk past a downtown toronto starbucks coffee location thursday may 31 2018graeme roythe canadian pressreferring to managing the coronavirus as the single biggest challenge many of us have faced in our lifetime starbucks canada has announ 2118 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Steve O'Hear", "title": "RTP Global outs new $650M early-stage fund to back tech in US, Europe, India and South-East Asia", "description": "RTP Global, the VC firm founded by Russian entrepreneur and investor Leonid Boguslavsky, is announcing a new $650 million fund to continue backing early-stage tech startups, primarily at Series A but also some late seed deals and Series B. Of note, the VC’s l…", "url": "http://techcrunch.com/2020/03/03/rtp-global-iii/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/rtp.png?w=556", "publishedAt": "2020-03-03T08:00:22Z", "content": "rtp global the vc firm founded by russian entrepreneur and investor leonid boguslavsky is announcing a new 650 million fund to continue backing earlystage tech startups primarily at series a but also some late seed deals and series bof note the vcs  3522 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Daily Crunch: Waymo raises $2.5B", "description": "Alphabet’s self-driving car company raises its first outside investment, Robinhood goes down and Pixel phones get new gesture controls. Here’s your Daily Crunch for March 3, 2020. 1. Waymo brings in $2.25B from outside investors, Alphabet This is the company’…", "url": "http://techcrunch.com/2020/03/03/daily-crunch-waymo-raises-2-5b/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/11/waymo.jpg?w=740", "publishedAt": "2020-03-03T18:43:43Z", "content": "alphabets selfdriving car company raises its first outside investment robinhood goes down and pixel phones get new gesture controls heres your daily crunch for march 3 20201 waymo brings in 225b from outside investors alphabetthis is the compan 3153 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jon Evans", "title": "Burn the EARN IT Act", "description": "I want to talk about malignant incompetence on the part of our elected officials, and this isn’t even about the pandemic. Rather, it’s about the spectacularly misguided, counterproductive, expensive, and overbearing approach to end-to-end encryption by the US…", "url": "http://techcrunch.com/2020/03/08/burn-the-earn-it-act/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/key-burning.jpg?w=741", "publishedAt": "2020-03-08T23:00:18Z", "content": "i want to talk about malignant incompetence on the part of our elected officials and this isnt even about the pandemic rather its about the spectacularly misguided counterproductive expensive and overbearing approach to endtoend encryption by the us 4339 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Megan Rose Dickey", "title": "DoorDash will offer financial assistance to delivery workers diagnosed with COVID-19 or quarantined", "description": "Food delivery startup DoorDash, which also runs operations for Caviar, has announced its plans to provide financial assistance to delivery workers who are diagnosed with COVID-19 or quarantined. DoorDash workers in the U.S., Australia and Canada are eligible …", "url": "http://techcrunch.com/2020/03/17/doordash-covid-19/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/09/doordash.jpg?w=601", "publishedAt": "2020-03-17T16:30:23Z", "content": "food delivery startup doordash which also runs operations for caviar has announced its plans to provide financial assistance to delivery workers who are diagnosed with covid19 or quarantineddoordash workers in the us australia and canada are eligible 2641 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kirsten Korosec", "title": "Major automakers Toyota, Honda, FCA extend factory closures", "description": "Toyota, Honda and Fiat Chrysler Automobiles will not reopen North American factories at the end of the month as planned as the COVID-19 disease spreads and dampens demand for new cars, trucks and SUVs. FCA said Thursday that plants across the U.S. and Canada,…", "url": "http://techcrunch.com/2020/03/26/major-automakers-toyota-honda-fca-extend-factory-closures/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/toyota-manufacturing.jpg?w=600", "publishedAt": "2020-03-26T19:26:12Z", "content": "toyota honda and fiat chrysler automobiles will not reopen north american factories at the end of the month as planned as the covid19 disease spreads and dampens demand for new cars trucks and suvsfca said thursday that plants across the us and canada 2554 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "J.M. Donaldson", "title": "Extra Crunch members get design tool Canva Pro free for 90 days", "description": "Extra Crunch is excited to announce a new community perk from design and publishing platform Canva. Starting today, annual and two-year members of Extra Crunch can receive 90 days of their Pro plan for free. You must be new to Canva to claim this offer, and r…", "url": "http://techcrunch.com/2020/03/02/extra-crunch-members-get-design-tool-canva-pro-free-for-90-days/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/02/EC-canva.jpg?w=753", "publishedAt": "2020-03-02T17:35:23Z", "content": "extra crunch is excited to announce a new community perk from design and publishing platform canva starting today annual and twoyear members of extra crunch can receive 90 days of their pro plan for free you must be new to canva to claim this offer and r 2421 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Frederic Lardinois", "title": "Emirates will suspend most passenger flights by March 25", "description": "Emirates, the world’s largest airline by international traffic, today briefly announced on Twitter and its own website that it would halt all passenger flights by March 25 but then reversed course and said that it would still fly to 13 destinations, including…", "url": "http://techcrunch.com/2020/03/22/emirates-will-suspend-most-passenger-flights-by-march-25/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/ETuXMsJWkAQnOAT.jpg?w=710", "publishedAt": "2020-03-22T16:25:04Z", "content": "emirates the worlds largest airline by international traffic today briefly announced on twitter and its own website that it would halt all passenger flights by march 25 but then reversed course and said that it would still fly to 13 destinations including 1402 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kirsten Korosec", "title": "Ford won’t restart North American plants March 30", "description": "Ford said Tuesday won’t restart its factories in the U.S., Canada and Mexico on Monday, March 30 as the automaker had originally planned. The company, which suspended production at its North American factories due to the continued spread of COVID-19, has deci…", "url": "http://techcrunch.com/2020/03/24/ford-wont-restart-north-american-plants-march-30/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-1041983056.jpeg?w=600", "publishedAt": "2020-03-24T17:02:02Z", "content": "ford said tuesday wont restart its factories in the us canada and mexico on monday march 30 as the automaker had originally plannedthe company which suspended production at its north american factories due to the continued spread of covid19 has dec 1020 chars"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Jeff Lewis", "title": "Miners avoid handshakes at Toronto meeting over coronavirus fears", "description": "Miners in Toronto for an annual industry dealmaking event slathered on hand sanitizer and avoided handshakes, while Chile's mines minister doled out masks as coronavirus concerns overshadowed buyout buzz and prompted delegates to scrap some events.", "url": "https://www.reuters.com/article/us-mining-pdac-coronavirus-idUSKBN20P2Y5", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200302&t=2&i=1497818674&w=1200&r=LYNXMPEG212BN", "publishedAt": "2020-03-02T19:44:17Z", "content": "toronto reuters  miners in toronto for an annual industry dealmaking event slathered on hand sanitizer and avoided handshakes while chiles mines minister doled out masks as coronavirus concerns overshadowed buyout buzz and prompted delegates to scrap som 2505 chars"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Husky CEO slams Ottawa for derailing projects with politics - Yahoo Canada Finance", "description": "Husky CEO slams Ottawa for derailing projects with politics Yahoo Canada Finance Husky Energy CEO blames regulatory process 'that just went on and on' for end of Teck Frontier mine CBC.ca Experts say Alberta hasn’t learned the lesson about climate change and …", "url": "https://ca.finance.yahoo.com/news/husky-ceo-slams-ottawa-for-derailing-projects-with-politics-200524167.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/wetoGhPJ1dWlgGRSUVejag--~A/YXBwaWQ9aGlnaGxhbmRlcjt3PTU1OTc7aD0zNzMxO3NtPTE7aWw9cGxhbmU-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-02/6ac86aa0-5995-11ea-bffd-0a2b33935cb4.cf.jpg", "publishedAt": "2020-02-27T20:05:00Z", "content": "husky energys hseto chief executive officer says major energy projects are unlikely to move forward in canada unless ottawa does more to reduce political uncertainty and lengthy expensive approval processesspeaking on a conference call following the r 3915 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "North American stock markets rally to start the week higher; loonie climbs - CTV News", "description": "North American stock markets rally to start the week higher; loonie climbs CTV News At midday: TSX reverses early slide and jumps higher The Globe and Mail Toronto market down in early trading to start the week, loonie edges higher CP24 Toronto's Breaking New…", "url": "https://www.ctvnews.ca/business/north-american-stock-markets-rally-to-start-the-week-higher-loonie-climbs-1.4834419", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4834605.1583155552!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-02T16:47:00Z", "content": "toronto  canadas main stock index rallied in latemorning trading as it posted a tripledigit gain to start the week following its worst losses since the financial crisis last weekthe sampptsx composite index was up 13120 points at 1639425in  629 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Trudeau unveils new measures to mobilize industry in COVID-19 fight, bring Canadians home - CTV News", "description": "Trudeau unveils new measures to mobilize industry in COVID-19 fight, bring Canadians home CTV News Canada to turn back asylum seekers, close border at midnight to stop spread of COVID-19 CBC.ca Irregular migrants to be turned away at Canadian border CTV News …", "url": "https://www.ctvnews.ca/health/coronavirus/trudeau-unveils-new-measures-to-mobilize-industry-in-covid-19-fight-bring-canadians-home-1.4861302", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4855450.1584397744!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-20T18:39:00Z", "content": "ottawa  prime minister justin trudeau has announced a new plan to mobilize businesses and manufacturers to help fight the spread of covid19 and boost the health sectors stockpile of lifesaving supplies and says the government is working with airlines t 6179 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Canada, U.S. working out details of cross-border non-essential travel ban - CTV News", "description": "Canada, U.S. working out details of cross-border non-essential travel ban CTV News How to apply for EI and COVID-19 emergency benefits CBC.ca PM: Canada-U.S. border closing; $27B in direct aid, $55B to businesses CTV News LILLEY: Trudeau steps up as virus cri…", "url": "https://www.ctvnews.ca/health/coronavirus/trudeau-to-update-on-covid-19-as-border-restricted-mps-prepare-to-pass-aid-package-1.4859341", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4856393.1584459162!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-19T09:15:18Z", "content": "ottawa  a week into his selfisolation prime minister justin trudeau will once again be addressing canadians on the latest developments with the covid19 pandemic and canadas responseafter delivering major news on two fronts on wednesday  the closu 2109 chars"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Canada to close borders to most foreign nationals, except Americans - The Globe and Mail", "description": "Canada to close borders to most foreign nationals, except Americans The Globe and Mail Canada shutting the border to most non-citizens due to COVID-19: PM Trudeau CTV News Global National: March 15, 2020 | Countries clamp down as coronavirus continues to spre…", "url": "https://www.theglobeandmail.com/politics/article-canada-to-close-borders-to-most-foreign-nationals-except-americans-2/", "urlToImage": "https://www.theglobeandmail.com/resizer/dU1jD3gwA-tD5Enm_s8sbNMSsSk=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/OB4CESQ72FDJ5GTIFYFAYVMRPA.jpg", "publishedAt": "2020-03-16T23:56:00Z", "content": "beginning wednesday only four airports in the country toronto pearson vancouver calgary and montreal trudeau will be accepting international flights prime minister justin trudeau saidlars hagbergthe canadian presscanada will close its borders to peo 4663 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Rory Sullivan", "title": "Canadian scientists discover ancient continent was larger than we thought - CTV News", "description": "Canadian scientists discover ancient continent was larger than we thought CTV News Lost fragment of ancient continent found at De Beers' project in Canada MINING.com Diamond samples in Canada reveal size of lost continent The Union Journal Canadian Scientists…", "url": "https://www.ctvnews.ca/world/canadian-scientists-discover-ancient-continent-was-larger-than-we-thought-1.4863658", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4863678.1584917074!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-22T23:23:08Z", "content": "geologists in canada have found that an ancient continent was 10 per cent larger than previously estimated after analyzing rock samples dug up during diamond exploration workresearchers from the university of british columbia ubc made the chance discover 1269 chars"}, {"source": {"id": null, "name": "Abc14news.com"}, "author": "Brandon G. Jones", "title": "Fragment of lost continent discovered in Canada - ABC 14 News", "description": "Fragment of lost continent discovered in Canada ABC 14 News Canadian scientists discover ancient continent was larger than we thought The Loop The Fragment of an Ancient Lost Continent Has Been Discovered Off The Coast of Canada ScienceAlert Diamond-studded r…", "url": "https://abc14news.com/2020/03/23/fragment-of-lost-continent-discovered-in-canada/", "urlToImage": "https://abc14news.com/wp-content/uploads/2020/03/baffin-island-canada-01.jpg", "publishedAt": "2020-03-24T00:04:00Z", "content": "geologists have found portion of an historical shed continent by sifting through diamond samples from canadas baffin islandby analyzing the samples analysts identified aspect of the north atlantic craton a remnant of the earths historic continental crust 1565 chars"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy, CNN", "title": "Duke won't play in March Madness after university suspends sports competition", "description": "Five-time national champion Duke University will not play in the NCAA men's basketball tournament because of coronavirus concerns, the school announced Thursday.", "url": "https://www.cnn.com/2020/03/12/us/march-madness-withdrawals-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200129113452-mike-krzyzewski-0128-super-tease.jpg", "publishedAt": "2020-03-12T19:58:35Z", "content": "cnnfivetime national champion duke university will not play in the ncaa mens basketball tournament because of coronavirus concerns the school announced thursday the private university in durham north carolina is suspending its sports programs for th 904 chars"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Privacy watchdog probes RCMP use of facial-recognition software - Canada News - Castanet.net", "description": "Privacy watchdog probes RCMP use of facial-recognition software - Canada News Castanet.net RCMP's use of Clearview AI facial recognition technology under investigation CBC.ca Facial recognition app Clearview AI has been used far more widely in Canada than pre…", "url": "https://www.castanet.net/news/Canada/278210/Privacy-watchdog-probes-RCMP-use-of-facial-recognition-software", "urlToImage": "https://www.castanet.net/content/2020/2/CPT11047520_p3441629.jpg", "publishedAt": "2020-02-28T18:30:00Z", "content": "the federal privacy commissioner is investigating the rcmps use of cuttingedge facialrecognition softwarethe technology made by american company clearview ai gathers huge numbers of images from various sources that can help police forces and financial i 706 chars"}, {"source": {"id": null, "name": "Nationalpost.com"}, "author": null, "title": "The latest developments on COVID-19 in Canada - Ottawa Citizen", "description": "The latest developments on COVID-19 in Canada Ottawa Citizen U.S. recommends cancelling gatherings over 50 people for next 8 weeks; Ontario's Superior Court suspending most operations; Alberta confirms 17 new cases of COVID-19 Toronto Star Coronavirus: What's…", "url": "https://nationalpost.com/pmn/news-pmn/canada-news-pmn/the-latest-developments-on-covid-19-in-canada-9", "urlToImage": "https://postmediaottawacitizen2.files.wordpress.com/2020/03/afp_1pv6nz.jpg", "publishedAt": "2020-03-15T15:31:06Z", "content": "the latest news on the covid19 global pandemic all times eastern230 pmnova scotia premier stephen mcneil says schools in the province will be temporarily closed in response to the covid19 outbreakhe says that although classes are out for march  4789 chars"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Micaela Heck", "title": "How to Stop Procrastinating, With Behavior Scientist BJ Fogg", "description": "Do you put things off ‘til the last minute? Are you one of the millions who tend to delay getting to your to-do list? Then you’re in luck—behavior scientist BJ Fogg joins us on this episode to talk about how to stop procrastinating thanks to his researched ap…", "url": "https://lifehacker.com/how-to-stop-procrastinating-with-behavior-scientist-bj-1842027698", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ukzhhbrhsh6wqtzbfdug.jpg", "publishedAt": "2020-03-03T14:30:00Z", "content": "do you put things off til the last minute are you one of the millions who tend to delay getting to your todo list then youre in luckbehavior scientist bj fogg joins us on this episode to talk about how to stop procrastinating thanks to his researched appro 1947 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Alexander Quon", "title": "Coronavirus to slash Atlantic Canada’s cruise season - Global News", "description": "Coronavirus to slash Atlantic Canada’s cruise season Global News COVID-19: Feds announce restrictions to overseas flights and further limits on cruises CTV News Victoria city council asking for ban on cruise ship visits to city amid coronavirus pandemic Globa…", "url": "http://globalnews.ca/news/6672912/atlantic-canadas-cruise-season-covid/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2018/12/CPT503521495.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-13T19:52:19Z", "content": "new federal restrictions on cruise ships are set to wreak havoc with eastern canadas cruise ship season with thousands of expected visitors no longer permitted to dock in canadatransport minister marc garneau announced on friday that no cruise ships carr 2052 chars"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francisco Guzman and Brian Ries, CNN", "title": "Bars near one university are giving women a secret way to signal if they feel unsafe", "description": "The Florida Atlantic University Student Government created posters to hang in local bars and restaurants to give women a secret way to alert bartenders if they're in danger or on an uncomfortable date.", "url": "https://www.cnn.com/2020/03/06/us/florida-university-bartenders-date-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200306144742-florida-university-alert-bartenders-date-trnd-super-tease.jpg", "publishedAt": "2020-03-06T16:42:39Z", "content": null}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "mattbingley", "title": "COVID-19 spurs calls to reduce traffic in Toronto hospitals - Global News", "description": "COVID-19 spurs calls to reduce traffic in Toronto hospitals Global News FUREY: It seems the public health system really is working in Canada – for now Toronto Sun Risk of coronavirus remains low - Chirico The North Bay Nugget Toronto man who returned from Swi…", "url": "http://globalnews.ca/news/6657858/covid-19-toronto-hospitals/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/covid-tester.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-10T23:12:15Z", "content": "with the number of positive cases of covid19 continuing to grow especially in the toronto region preparations are underway to quell the possibility of infection spread within health facilitiescanadas first positive case of covid19 saw the patient atten 2814 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Olivia Bowden", "title": "Do you think you have coronavirus symptoms? Here’s who to call first - Global News", "description": "Do you think you have coronavirus symptoms? Here’s who to call first Global News Losing our touch? Some alternative greetings amid coronavirus fears Toronto Star 4 more positive cases of COVID-19 discovered in Ontario CBC.ca Three new cases of COVID-19 confir…", "url": "http://globalnews.ca/news/6640386/coronavirus-symptoms/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/covid-19-airport.png?w=720&h=379&crop=1", "publishedAt": "2020-03-06T19:24:50Z", "content": "as of march 6 a total of 45 confirmed cases of covid19 have been confirmed in canada with most occurring in ontario and bchealth officials are continuing to grapple with the new cases and are preparing for the possibility of an outbreak similar to the  6293 chars"}, {"source": {"id": null, "name": "Cp24.com"}, "author": "Ross Marowits", "title": "Toronto stock market posts first back-to-back rally since COVID-19 crisis - CP24 Toronto's Breaking News", "description": "Canada's main stock index posted its first back-to-back rally since the COVID-19 crisis began to hit stocks last month as stimulus measures appear set to become a reality in Canada and the U.S.", "url": "https://www.cp24.com/news/toronto-stock-market-posts-first-back-to-back-rally-since-covid-19-crisis-1.4868551", "urlToImage": "https://www.cp24.com/polopoly_fs/1.1240628.1576082444!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-25T23:20:00Z", "content": "toronto  canadas main stock index posted its first backtoback rally since the covid19 crisis began to hit stocks last month as stimulus measures appear set to become a reality in canada and the usthe tsx was the prime beneficiary and led the global c 3718 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Laura Osman", "title": "Canada's top doctor says country ready with co-ordinated response to COVID-19 - CTV News", "description": "A Canadian patient newly diagnosed with COVID-19 recently travelled to Las Vegas and used public transit in Toronto for several days before he was tested for the virus, says the Toronto public health authority.", "url": "https://www.ctvnews.ca/health/coronavirus/canada-s-top-doctor-says-country-ready-with-co-ordinated-response-to-covid-19-1.4842806", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4842848.1583541985!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-07T06:40:45Z", "content": "ottawa  a canadian patient newly diagnosed with covid19 recently travelled to las vegas and used public transit in toronto for several days before he was tested for the virus says the toronto public health authoritythe man who is in his 40s was one 5629 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Michelle McQuigge", "title": "What you need to know about the Quarantine Act as isolation becomes mandatory for returning travellers - CTV News", "description": "What you need to know about the Quarantine Act as isolation becomes mandatory for returning travellers CTV News Strict new mandatory quarantine rules come into effect at midnight for returning Canadians CBC.ca What you need to know about the Quarantine Act To…", "url": "https://www.ctvnews.ca/health/coronavirus/what-you-need-to-know-about-the-quarantine-act-as-isolation-becomes-mandatory-for-returning-travellers-1.4868457", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4856526.1584463232!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-25T23:13:09Z", "content": "canada is making unprecedented use of the federal quarantine act in a bid to curb the spread of the covid19 pandemic the order which went into effect early wednesday hours before it was announced means all travellers returning to canada are now legally r 4839 chars"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "Canada to begin enforcing 14-day self-isolation for travellers - The Globe and Mail", "description": "Canada to begin enforcing 14-day self-isolation for travellers The Globe and Mail Strict new mandatory quarantine rules come into effect at midnight for returning Canadians CBC.ca Coronavirus outbreak: \"Significant penalties\" if quarantines violated, Canadian…", "url": "https://www.theglobeandmail.com/politics/article-canada-to-begin-enforcing-14-day-self-isolation-for-travellers/", "urlToImage": "https://www.theglobeandmail.com/resizer/6XjN6fhtrZ6bDmQhQvSkxzO9B7A=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/KIPWDN5XIJDG5OOE5GC4QB7OCQ.jpg", "publishedAt": "2020-03-25T16:48:31Z", "content": "health minister patty hajdu responds to a question during a special sitting of parliament in the house of commons in the early hours wednesday march 25 2020 in ottawa adrian wyldthe canadian presshealth minister patty hajdu is now exercising powers aff 4961 chars"}, {"source": {"id": "time", "name": "Time"}, "author": "Rob Gillies and Zeke Miller / AP", "title": "U.S., Canadian Border Closing For Nonessential Travel", "description": "The U.S. and Canada have agreed to temporarily close their shared border to nonessential travel, President Donald Trump announced Wednesday", "url": "https://time.com/5805593/us-canada-border-closed-coronavirus/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/us-canada-border-closed-coronavirus.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2020-03-18T15:12:12Z", "content": "toronto  the us and canada have agreed to temporarily close their shared border to nonessential travel president donald trump announced wednesday as the two nations work to stem the spread of the coronavirus pandemicboth countries are eager to choke  3648 chars"}, {"source": {"id": null, "name": "Surreynowleader.com"}, "author": "Katya Slepian", "title": "COVID-19: What’s open and closed in B.C. as a result of the novel coronavirus - Surrey Now-Leader", "description": "COVID-19: What’s open and closed in B.C. as a result of the novel coronavirus Surrey Now-Leader B.C. VIEWS: Effects of COVID-19 pandemic will be long-lasting Victoria News COVID-19: What’s open and closed in B.C. amid the novel coronavirus pandemic Nanaimo Ne…", "url": "https://www.surreynowleader.com/news/covid-19-whats-open-and-closed-in-b-c-amid-the-novel-coronavirus-pandemic/", "urlToImage": "https://www.surreynowleader.com/wp-content/uploads/2020/03/20942549_web1_22932031-1024x683.jpg", "publishedAt": "2020-03-16T00:30:00Z", "content": "as covid19 cases continue to rise in canada heres whats open closed and not advised especially in bcas of sunday there were at least 313 cases in canada 73 of those in blush closes all storesnatural bath skincare and cosmetics retailer lush 3333 chars"}, {"source": {"id": null, "name": "Thefreepress.ca"}, "author": "Katya Slepian", "title": "COVID-19: What’s open and closed in B.C. as a result of the novel coronavirus - Fernie Free Press", "description": "COVID-19: What’s open and closed in B.C. as a result of the novel coronavirus Fernie Free Press View Full coverage on Google News", "url": "https://www.thefreepress.ca/news/covid-19-whats-open-and-closed-in-b-c-amid-the-novel-coronavirus-pandemic/", "urlToImage": "https://www.thefreepress.ca/wp-content/uploads/2020/03/20942549_web1_22932031-1024x683.jpg", "publishedAt": "2020-03-16T00:30:00Z", "content": "as covid19 cases continue to rise in canada heres whats open closed and not advised especially in bcas of sunday there were at least 313 cases in canada 73 of those in blush closes all storesnatural bath skincare and cosmetics retailer lush 3333 chars"}, {"source": {"id": null, "name": "Goldstreamgazette.com"}, "author": "Katya Slepian", "title": "COVID-19: What’s open and closed in B.C. as a result of the novel coronavirus - Goldstream News Gazette", "description": "COVID-19: What’s open and closed in B.C. as a result of the novel coronavirus Goldstream News Gazette View Full coverage on Google News", "url": "https://www.goldstreamgazette.com/news/covid-19-whats-open-and-closed-in-b-c-amid-the-novel-coronavirus-pandemic/", "urlToImage": "https://www.goldstreamgazette.com/wp-content/uploads/2020/03/20942549_web1_22928104-1024x683.jpg", "publishedAt": "2020-03-16T00:30:00Z", "content": "as covid19 cases continue to rise in canada heres whats open closed and not advised especially in bcas of sunday there were at least 313 cases in canada 73 of those in bcaritzia shuts down storesthe canadian clothing retailer is shutting dow 3712 chars"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "hannahjacksonglobal", "title": "Coronavirus: How long can Canadians expect to be social distancing? - Global News", "description": "Coronavirus: How long can Canadians expect to be social distancing? Global News The latest on the coronavirus: Ontario records second pandemic death; border restrictions to kick in Friday night, PM says The Globe and Mail Ontario to waive three-month OHIP wai…", "url": "http://globalnews.ca/news/6695737/coronavirus-canadians-social-distancing/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/22948946.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-18T18:09:19Z", "content": "for weeks health officials across the country have been urging canadians to practise social distancing and avoid public gatherings in an attempt to limit the spread of the novel coronavirusthe disease caused by the virus  covid19  has infected more tha 6352 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Coronavirus: What does pandemic mean? - CTV News", "description": "As the list of countries dealing with COVID-19 grows, a Toronto infectious disease expert says the virus outbreak is already likely at pandemic level – but that’s not clear because some countries are hiding the extent of their outbreak.", "url": "https://www.ctvnews.ca/health/what-would-it-mean-if-covid-19-becomes-a-pandemic-1.4828528", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4828531.1582737195!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-02-26T17:19:00Z", "content": "toronto  as the list of countries dealing with covid19 grows a toronto infectious disease expert says the virus outbreak is already likely at pandemic level but thats not clear because some countries are hiding the extent of their outbreakpeople are  8481 chars"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Esteban Duarte", "title": "TD, Scotiabank Issue $11 Billion of Repo-Eligible Bonds - Yahoo Canada Finance", "description": "(Bloomberg) -- Toronto-Dominion Bank priced the largest covered bond on record from a Canadian lender on Friday, days after the country’s central bank widened the range of securities it takes as guarantee for repurchase transactions. Bank of Nova Scotia follo…", "url": "https://ca.finance.yahoo.com/news/td-scotiabank-issue-11-billion-233306646.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/GBFSoKvEgG5_q6vCEJ3zOw--~B/aD0xMzQ1O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/66ada74bad785d06bbe6f8b9e8e222f1", "publishedAt": "2020-03-23T23:33:00Z", "content": "bloomberg  torontodominion bank priced the largest covered bond on record from a canadian lender on friday days after the countrys central bank widened the range of securities it takes as guarantee for repurchase transactions bank of nova scotia follow 1722 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Lee Berthiaume", "title": "Border agency adds screening questions after complaints about airport disarray - CTV News", "description": "Border agency adds screening questions after complaints about airport disarray CTV News CBSA officer at Toronto Pearson tests positive for COVID-19 CTV News Border agents to start warning all air travellers of 14-day isolation period The Globe and Mail CBSA s…", "url": "https://www.ctvnews.ca/politics/border-agency-adds-screening-questions-after-complaints-about-airport-disarray-1.4854787", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4853801.1584282098!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-16T20:17:28Z", "content": "ottawa  the canada border services agency announced new screening questions for travellers arriving monday following a weekend of disarray at points of entry into the country especially airportswhile the federal government wants people returning to ca 1851 chars"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Doctor describes dire situation in hospitals treating virus", "description": "Columbia University Medical Center's Dr. Craig Spencer talks with CNN's Anderson Cooper about the dire situation facing hospitals as they try to treat patients with coronavirus.", "url": "https://www.cnn.com/videos/health/2020/03/25/craig-spencer-ny-hospital-trump-magical-thinking-sot-ac-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200325002947-doctor-craig-spencer-may-24-2020-01-super-tease.jpg", "publishedAt": "2020-03-25T04:39:47Z", "content": "chat with us in facebook messenger find out whats happening in the world as it unfolds"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "3-D video shows Covid-19 attack patient's lungs", "description": "CT imaging from George Washington University Hospital shows the effects of Covid-19 on the lungs of a 59-year old man.", "url": "https://www.cnn.com/videos/us/2020/03/26/3d-video-shows-covid-19-attack-lungs.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200325000535-covid-19-lung-damage-video-super-tease.jpg", "publishedAt": "2020-03-26T21:01:44Z", "content": "chat with us in facebook messenger find out whats happening in the world as it unfolds"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "gabbyrodrigues", "title": "Sudbury man who attended Toronto convention confirmed as Ontario’s 37th coronavirus case - Global News", "description": "Sudbury man who attended Toronto convention confirmed as Ontario’s 37th coronavirus case Global News Toronto man who returned from Switzerland is Ontario's 36th COVID-19 case CP24 Toronto's Breaking News New coronavirus case confirmed in Ontario durhamradione…", "url": "http://globalnews.ca/news/6655133/ontario-coronavirus-covid19-36-case-switzerland/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/03/cpt50150590-11.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-03-10T15:39:15Z", "content": "health officials say that a man in his 50s who recently attended a convention in toronto has been confirmed as the first case of covid19 in the sudbury area bringing ontarios total up to 37an online statement from public health sudbury amp districts s 1560 chars"}, {"source": {"id": "financial-post", "name": "Financial Post"}, "author": null, "title": "PDAC mining conference goers asked to monitor for coronavirus symptoms after Sudbury area man tests positive - Financial Post", "description": "PDAC mining conference goers asked to monitor for coronavirus symptoms after Sudbury area man tests positive Financial Post Sudbury man who attended Toronto conference has COVID-19: health officials CP24 Toronto's Breaking News Coronavirus update: Man from Su…", "url": "https://business.financialpost.com/commodities/mining/pdac-mining-conference-participants-asked-to-monitor-for-coronavirus-symptoms-after-sudbury-area-man-tests-positive", "urlToImage": "https://financialpostcom.files.wordpress.com/2020/03/justin-trudeau-2.jpg", "publishedAt": "2020-03-11T12:32:00Z", "content": "anyone who attended the prospectors amp developers association of canada 2020 convention in toronto is being asked to monitor themselves for symptoms of the coronavirus after a man who attended was tested positive in the sudbury areadr penny sutcliffe  2354 chars"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Mariella Moon", "title": "Google debuts 'Works With Chromebook' badge for accessories", "description": "If you've ever bought a cable, a charger or any other accessory that ended up incompatible with the device it's meant for, you'll likely appreciate Google's latest \" Works With \" badge. The tech giant has debuted the \"Works With Chromebook\" logo, which can gi…", "url": "https://www.engadget.com/2020/03/18/google-works-with-chromebook/", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fresize%3D2000%252C2000%252Cshrink%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2020-03%252F0d79be50-691a-11ea-a585-60bce3c353d2%26client%3Da1acac3e1b3290917d92%26signature%3Db68b63b644c3106e95addf33de9e4e59e4331727&client=amp-blogside-v2&signature=34106355d6de8f064bad5e5b478363294dc1fd07", "publishedAt": "2020-03-18T13:10:00Z", "content": "google says all accessories with the badge have been tested and are guaranteed to comply with chromebooks compatibility standards thus far the company has certified products from several famous brands including anker kensington and logitech also certif 223 chars"}, {"source": {"id": null, "name": "Cp24.com"}, "author": "Chris Herhalt", "title": "Toronto man who returned from Switzerland is Ontario's 36th COVID-19 case - CP24 Toronto's Breaking News", "description": "Toronto man who returned from Switzerland is Ontario's 36th COVID-19 case CP24 Toronto's Breaking News Sudbury man who attended Toronto convention confirmed as Ontario’s 37th coronavirus case Global News Ontario's 36th COVID-19 patient is a Toronto man who tr…", "url": "https://www.cp24.com/news/toronto-man-who-returned-from-switzerland-is-ontario-s-36th-covid-19-case-1.4846470", "urlToImage": "https://www.cp24.com/polopoly_fs/1.4833445.1583009316!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-10T14:40:00Z", "content": "public health officials confirmed one new case of the novel coronavirus in ontario involving a toronto man who recently returned to the province from switzerlandthe news brings ontarios total case count including recoveries to 36 with five people who hav 1191 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Toronto, York Region report first local COVID-19-related deaths - CTV News", "description": "Toronto, York Region report first local COVID-19-related deaths CTV News Coronavirus outbreak: Ontario announces 308 total confirmed positive COVID-19 cases | FULL Global News Three new cases of COVID-19 in Ottawa, including girl under 18 CTV News Gatineau Pa…", "url": "https://toronto.ctvnews.ca/toronto-york-region-report-first-local-covid-19-related-deaths-1.4863343", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4844951.1583769980!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-03-22T14:38:00Z", "content": "toronto  health officials have reported the first covid19related deaths in toronto and york region as the total number of cases in ontario rises to 425toronto public health tph said on sunday that a man in his 70s was the citys first covid19re 4291 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Steve O'Hear", "title": "AudioTelligence raises $8.5M Series A to bring its ‘autofocus for sound’ to voice assistants", "description": "AudioTelligence, a startup that spun out of University of Cambridge-funded CEDAR Audio, has raised $8.5 million in Series A funding for its “autofocus for sound”. Leading the round is Octopus Ventures, with participation from existing investors Cambridge Inno…", "url": "http://techcrunch.com/2020/03/02/audiotelligence/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/KenRoberts1.jpg?w=602", "publishedAt": "2020-03-02T09:00:56Z", "content": "audiotelligence a startup that spun out of university of cambridgefunded cedar audio has raised 85 million in series a funding for its autofocus for soundleading the round is octopus ventures with participation from existing investors cambridge inn 2580 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "Oura partners with UCSF to determine if its smart ring can hep detect COVID-19 early", "description": "Startups continue to find new ways to contribute to ongoing efforts to fight the global spread of COVID-19 during the current global coronavirus pandemic, and personal health hardware-maker Oura is no exception. The smart ring startup is working with the Univ…", "url": "http://techcrunch.com/2020/03/23/oura-partners-with-ucsf-to-determine-if-its-smart-ring-can-hep-detect-covid-19-early/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/Oura-Ring.jpg?w=656", "publishedAt": "2020-03-23T23:08:36Z", "content": "startups continue to find new ways to contribute to ongoing efforts to fight the global spread of covid19 during the current global coronavirus pandemic and personal health hardwaremaker oura is no exception the smart ring startup is working with the univ 2152 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "Oxford Uni academics launch a tracker for COVID-19 policy interventions", "description": "Oxford University academics have launched a project to track government responses to the coronavirus pandemic. The tool, called the Oxford COVID-19 Government Response Tracker (OxCGRT), tracks 11 indicators to generate an index that compares the stringency of…", "url": "http://techcrunch.com/2020/03/25/oxford-uni-academics-launch-a-tracker-for-covid-19-policy-interventions/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/Screenshot-2020-03-25-at-16.06.24.png?w=764", "publishedAt": "2020-03-25T15:11:16Z", "content": "oxford university academics have launched a project to track government responses to the coronavirus pandemicthe tool called the oxford covid19 government response tracker oxcgrt tracks 11 indicators to generate an index that compares the stringency o 2061 chars"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Mariella Moon", "title": "Netflix pauses production on 'Stranger Things,' other shows due to coronavirus", "description": "TV and media giants, including streaming services, are feeling the effects of the global coronavirus pandemic. According to The Hollywood Reporter and Deadline, Netflix has put a pause on all scripted TV and film production for two weeks in the US and Canada …", "url": "https://www.engadget.com/2020/03/13/netflix-pauses-production-tv-film/", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D1457%252C888%252C211%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C975%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2020-03%252F4feb4000-6583-11ea-bfdd-633fe1d52ba5%26client%3Da1acac3e1b3290917d92%26signature%3D674de922ec57b9005882577faaefee7812f306fe&client=amp-blogside-v2&signature=70d151be25d04d60d5fb4a50bf5c2d38d5e278f0", "publishedAt": "2020-03-14T00:38:00Z", "content": "the affected shows include viewer favorite stranger things which had to shut down its fourth seasons production as well as supernatural detective series lucifer and groundhog dayesque comedy drama russian doll shows being filmed outside the us and canada 524 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Nova Scotia declares state of emergency, identifies 7 more cases of COVID-19 - CTV News", "description": "Nova Scotia declares state of emergency, identifies 7 more cases of COVID-19 CTV News N.S. declares state of emergency in response to COVID-19 CBC.ca The latest on the coronavirus: Canada refuses to go to Olympics unless postponed; Trudeau not at point of dec…", "url": "https://atlantic.ctvnews.ca/nova-scotia-declares-state-of-emergency-identifies-7-more-cases-of-covid-19-1.4863349", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4863353.1584888790!/httpImage/image.png_gen/derivatives/landscape_620/image.png", "publishedAt": "2020-03-22T14:48:00Z", "content": "halifax  nova scotia premier stephen mcneil has officially declared a state of emergency in the province due to the covid19 pandemiceffective 6 am monday the borders of nova scotia will be tightened with screening processes at all points of entry  3439 chars"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "'These kids are coming home': Ford says there are plans to bring back Ontario students stranded in Peru - CTV News", "description": "'These kids are coming home': Ford says there are plans to bring back Ontario students stranded in Peru CTV News Doug Ford says the COVID-19 fight depends on good data. A Star analysis found problems with the government’s case count Toronto Star Private compa…", "url": "https://toronto.ctvnews.ca/these-kids-are-coming-home-ford-says-there-are-plans-to-bring-back-ontario-students-stranded-in-peru-1.4859379", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4859381.1584615020!/httpImage/image.png_gen/derivatives/landscape_620/image.png", "publishedAt": "2020-03-19T10:52:00Z", "content": "toronto  premier doug ford says arrangements have been made to bring home a group of king city high school students who are stuck in peru after the south american country closed its borders last weekendspeaking at queens park on thursday ford said pla 3127 chars"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Christine Fisher", "title": "Uber Eats waives delivery fees for over 100,000 independent restaurants", "description": "In response to the coronavirus pandemic and its impact on the restaurant industry, Uber Eats is waiving delivery fees for over 100,000 independent restaurants across the US and Canada. It's the latest move by gig-economy businesses like Uber, Lyft and Grubhub…", "url": "https://www.engadget.com/2020-03-16-uber-eats-waives-delivery-fees-independent-restaurants.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fs.yimg.com%2Fuu%2Fapi%2Fres%2F1.2%2FYD2zif8DEapiHM7epOxN6w--%7EB%2Fdz0xNjAwO2g9OTk5O2FwcGlkPXl0YWNoeW9u%2Fhttps%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D3641%252C2274%252C221%252C300%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1000%26image_uri%3Dhttps%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-03%2F61eefcb0-67c2-11ea-bfff-d6ece2299d14%26client%3Da1acac3e1b3290917d92%26signature%3Dafaed61b7ad2752cfa2b2925f0bd654e8ebcd776&client=amp-blogside-v2&signature=57f0a30250ccd185e136319c46795824ed38a44c", "publishedAt": "2020-03-16T20:34:00Z", "content": "uber eats is also launching daily marketing campaigns to promote delivery from local restaurants especially those that are new to the app it will allow restaurants of all sizes to opt into daily payments on all uber eats orders rather than weekly billing  664 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Megan Rose Dickey", "title": "Inside the effort to turn startups into zebras, not unicorns", "description": "The priorities of venture capitalists don’t always align with those of startup founders and their workers. That’s why we’ve started to see more conversation and activity around cooperatives and the idea of Exiting to Community, spearheaded by Nathan Schneider…", "url": "http://techcrunch.com/2020/03/05/inside-the-effort-to-turn-startups-into-zebras-not-unicorns/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/04/zebra-vs-unicorn_preview.png?w=753", "publishedAt": "2020-03-05T16:15:23Z", "content": "the priorities of venture capitalists dont always align with those of startup founders and their workersthats why weve started to see more conversation and activity around cooperatives and the idea of exiting to community spearheaded by nathan schneide 1533 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Danny Crichton", "title": "Stanford cancels classes in response to novel coronavirus outbreak", "description": "Following on the heels of several major cancellations of events the past few days, including the SXSW conference in Austin and the tech conference SaaStr, Stanford University, which is located in the heart of Silicon Valley in Palo Alto, California, announced…", "url": "http://techcrunch.com/2020/03/06/stanford-cancels-classes-in-response-to-novel-coronavirus-outbreak/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/09/GettyImages-1172033932.jpg?w=598", "publishedAt": "2020-03-07T05:14:22Z", "content": "following on the heels of several major cancellations of events the past few days including the sxsw conferencein austin and the tech conference saastr stanford university which is located in the heart of silicon valley in palo alto california announced 1588 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "Oxford scientists develop new coronavirus test that provides results in just 30 minutes", "description": "Scientists at the University of Oxford have developed a new coronavirus test that produces results around three times faster than the current fastest testing methods, and that requires only relatively simple technical instrumentation. In addition to these ben…", "url": "http://techcrunch.com/2020/03/18/oxford-scientists-develop-new-coronavirus-test-that-provides-results-in-just-30-minutes/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/WeChat-Image_20200316113219.jpg?w=764", "publishedAt": "2020-03-18T12:42:01Z", "content": "scientists at the university of oxford have developed a new coronavirus test that produces results around three times faster than the current fastest testing methods and that requires only relatively simple technical instrumentation in addition to these ben 3125 chars"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Mascarenhas", "title": "Plastiq raises $75M to help small businesses use credit cards more", "description": "When Eliot Buchanan tried to use his credit card to pay his Harvard tuition bill, the payment was rejected because the university said it doesn’t accept credit. Realizing the same problem exists for thousands of different transactions like board, rent and ven…", "url": "http://techcrunch.com/2020/03/25/plastiq-raises-75m-to-help-small-businesses-use-credit-cards-more/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2017/02/gettyimages-517409138.png?w=711", "publishedAt": "2020-03-25T23:50:35Z", "content": "when eliot buchanan tried to use his credit card to pay his harvard tuition bill the payment was rejected because the university said it doesnt accept credit realizing the same problem exists for thousands of different transactions like board rent and vend 3618 chars"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Canada backs $57bn coronavirus relief bill - BBC News", "description": "An earlier version received backlash for granting Justin Trudeau's cabinet far-reaching powers.", "url": "https://www.bbc.com/news/world-us-canada-52022506", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/3C29/production/_111410451_hi060790316.jpg", "publishedAt": "2020-03-25T12:25:42Z", "content": "image copyrightafp canadas multibilliondollar relief package to respond to the coronavirus slowdown has passed in the senateit allows the government to spend c82bn 57bn 48bn in emergency aid and economic stimulus the bill received approval on 3389 chars"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": null, "title": "The latest on the coronavirus: Emergency payments to start in April - The Globe and Mail", "description": "The latest on the coronavirus: Emergency payments to start in April The Globe and Mail Premier Doug Ford is cutting daytime electricity prices by about $20 monthly | COVID-19 Toronto Star Ontarians will get a break on their hydro bills during COVID-19 pandemi…", "url": "https://www.theglobeandmail.com/canada/article-the-latest-on-the-coronavirus-good-deeds-shine-transplant-surgeries/", "urlToImage": "https://www.theglobeandmail.com/resizer/RSDP7YHzX3lqGt0xeN_6Z7bmfGY=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/6TKROIGQCNF6XF4XAC3I6XLBUQ.jpg", "publishedAt": "2020-03-25T09:21:33Z", "content": "latest headlinesullifederal government to rejig benefits for workers trudeau says it will deliver 2000 a month for four months to eachlilihealth minister patty hajdu says government will start enforcing 14day selfisolation period for traveller 20009 chars"}]